"""
Модуль для рекурсивного копіювання файлів з сортуванням за розширенням.

Програма приймає два аргументи командного рядка:
1. Шлях до вихідної директорії (обов'язковий).
2. Шлях до цільової директорії (необов'язковий, за замовчуванням створюється директорія "dist").

Програма виконує наступні дії:
- Перевіряє, чи існує вихідна директорія.
- Якщо цільова директорія не існує, створює її.
- Копіює всі файли з вихідної директорії в цільову,
сортуючи їх у підкаталоги на основі розширення файлів.

Модуль містить основну функцію `main()`, яка викликає
допоміжні функції для парсингу аргументів і копіювання файлів.
"""

import os
from copy_util import copy_and_sort_files
from arg_parser import parse_args

def main() -> None:
    """
    Основна функція програми. Виконує парсинг аргументів, перевірку існування вихідної директорії 
    та викликає функцію копіювання і сортування файлів.

    Аргументи:
    - source (Path): Шлях до вихідної директорії.
    - dest (Path): Шлях до директорії призначення. Якщо не передано, створюється "dist".

    Дії:
    - Якщо вихідна директорія не існує, виводить повідомлення.
    - Якщо цільова директорія не існує, створює її.
    - Копіює файли з вихідної директорії у цільову, сортує за розширенням.
    """
    args = parse_args()

    # Перевірка наявності вихідної директорії
    if not os.path.exists(args.source):
        print(f"Вихідна директорія {args.source} не існує.")
    else:
        # Створення цільової директорії, якщо її не існує
        os.makedirs(args.dest, exist_ok=True)

        # Копіювання та сортування файлів
        copy_and_sort_files(args.source, args.dest)


if __name__ == "__main__":
    main()
