"""
Модуль main.py

Цей модуль є точкою входу програми. Він отримує кількість дисків
від користувача, ініціалізує стан стрижнів і запускає процес
переміщення дисків за допомогою функції hanoi.
"""

from hanoi import hanoi

def main():
    """
    Основна функція програми. Отримує кількість дисків
    від користувача і запускає процес переміщення дисків.
    """
    n = int(input("Введіть кількість дисків: "))

    state = {
        'A': list(range(n, 0, -1)),
        'B': [],
        'C': []
    }

    print("\nПочатковий стан:", state)
    hanoi(n, 'A', 'C', 'B', state)
    print("\nКінцевий стан:", state)


if __name__ == "__main__":
    main()
